intro_list = []
for method in dir(intro_list):
    print(method)

#append - додає елемент з кінця списку
#__add__ - додає елемент з початку списку
#dir - перевіряє чи пустий список, може повертати значення
#pop - видаляє елемент зі списку та повертає його видаленим
#remove - видаляє перший елемент зі списку
#sort - сортує елементи списку в порядку зростання або спадання
#reverse - перевертає елементи списку
#copy - копією список, елемент
#extend - додає всі елементи списоку у кінець списку
#clear - очищає всі елементи список
#__str__ - перевіряє чи рядок є стрічкою